export const REGEX = {
  PHONE:
    /(\+84|84|0)+(3[2-9]|5[6|8|9]|9\d(?!5)|8[1-9]|7[0|6-9])+([0-9]{7})\b/i,
  NUMBER: /^[0-9]+$/,
  SKU: /^[^\s]*$/,
  CODE: /^[a-zA-Z0-9#_/\\|.-]{0,100}$/,
  ALIAS: /^[a-z0-9_-]{1,100}$/i,
  USERNAME: /^(\d|\w)+$/,
  EMAIL: /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/,
  VIETNAMESE_AND_NUMBER:
    /^[0-9a-zA-ZàáảãạăằắẳẵặâầấẩẫậđèéẻẽẹêềếểễệìíỉĩịòóỏõọôồốổỗộơờớởỡợùúủũụưừứửữựỳýỷỹỵÀÁẢÃẠĂẰẮẲẴẶÂẦẤẨẪẬĐÈÉẺẼẸÊỀẾỂỄỆÌÍỈĨỊÒÓỎÕỌÔỒỐỔỖỘƠỜỚỞỠỢÙÚỦŨỤƯỪỨỬỮỰỲÝỶỸỴ[\]{}\\|\s]+$/,
}
